meat-plant/ssl/Documents/ПроизводствоПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПроизводствоПродукции</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиСырья</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПродукции</xr:Item>
				<xr:Item>AccumulationRegister.РабочееВремя</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

meat-plant/ssl/Documents/ПроизводствоПродукции/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПроизводствоПродукции.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроизводствоПродукции.Дата КАК Дата,
	|	ПроизводствоПродукции.Номер КАК Номер,
	|	ПроизводствоПродукции.Ответственный КАК Ответственный,
	|	ПроизводствоПродукции.Склад КАК Склад,
	|	ПроизводствоПродукции.Продукция.(
	|		НомерСтроки КАК НомерСтроки,
	|		Продукт КАК Продукт,
	|		Количество КАК Количество
	|	) КАК Продукция,
	|	ПроизводствоПродукции.Сотрудники.(
	|		НомерСтроки КАК НомерСтроки,
	|		Сотрудник КАК Сотрудник
	|	) КАК Сотрудники,
	|	ПроизводствоПродукции.Ответственный.Подпись КАК Подпись
	|ИЗ
	|	Документ.ПроизводствоПродукции КАК ПроизводствоПродукции
	|ГДЕ
	|	ПроизводствоПродукции.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПродукцияШапка = Макет.ПолучитьОбласть("ПродукцияШапка");
	ОбластьПродукция = Макет.ПолучитьОбласть("Продукция");
	ОбластьСотрудникиШапка = Макет.ПолучитьОбласть("СотрудникиШапка");
	ОбластьСотрудники = Макет.ПолучитьОбласть("Сотрудники");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;          
		
		Если НЕ Выборка.Подпись.Пустая() Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Подпись);
			Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
				КартинкаПодпись = Новый Картинка(ДвоичныеДанные);
				Подвал.Рисунки.Подпись.Картинка = КартинкаПодпись;
			КонецЕсли;
		КонецЕсли;
		
        Номер = Выборка.Номер;
		Дата = Выборка.Дата;
		ОбластьЗаголовок.Параметры.Номер = Номер;
		ОбластьЗаголовок.Параметры.Дата = Дата;
		ТабДок.Вывести(ОбластьЗаголовок);
		СуммаИтог = 0;
		ТабДок.Вывести(ОбластьПродукцияШапка);
		ВыборкаПродукция = Выборка.Продукция.Выбрать();
		Пока ВыборкаПродукция.Следующий() Цикл
			ОбластьПродукция.Параметры.Заполнить(ВыборкаПродукция);
			ТабДок.Вывести(ОбластьПродукция, ВыборкаПродукция.Уровень()); 
			СуммаИтог = СуммаИтог + ВыборкаПродукция.Количество;
		КонецЦикла;
        		ТабДок.Вывести(ОбластьСотрудникиШапка);
		ВыборкаСотрудники = Выборка.Сотрудники.Выбрать();
		Пока ВыборкаСотрудники.Следующий() Цикл
			ОбластьСотрудники.Параметры.Заполнить(ВыборкаСотрудники);
			ТабДок.Вывести(ОбластьСотрудники, ВыборкаСотрудники.Уровень());
		КонецЦикла;
        Подвал.Параметры.ВсегоПоДокументу = Строка(СуммаИтог) + " кг";
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
